# DockablePaneId Properties

---
The DockablePaneId type exposes the following members.
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
#### Reference
DockablePaneId Class
Autodesk.Revit.UI Namespace